# IsWallPeakTop

## Description
Returns true if specified peak (by index) of a wall is top.

```pascal
FUNCTION IsWallPeakTop(
				hWall     : HANDLE;
				peakIndex : INTEGER) : BOOLEAN;
```

```python

def vs.IsWallPeakTop(hWall, peakIndex):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hWall|HANDLE||
|peakIndex|INTEGER||

## Version
Availability: from Vectorworks 2014
## Category
* Objects - Walls